Table of Contents
 Class CheckResWeld
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Check value for Weld
[Serializable]
[DataContract]
public class CheckResWeld
Inheritance
object
CheckResWeld
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 CheckStatus
Status of the Check
[DataMember]
public bool CheckStatus { get; set; }
Property Value
bool
 Id
Unique id of weld
[DataMember]
public int Id { get; set; }
Property Value
int
 Items
In case of presentation of groups plates (uncoiled beams)
[DataMember]
public List<int> Items { get; set; }
Property Value
List<int>
 LoadCaseId
Id of Load Case
[DataMember]
public int LoadCaseId { get; set; }
Property Value
int
 Name
Name of Weld
[DataMember]
public string Name { get; set; }
Property Value
string
 UnityCheck
Unity Check Stress
[DataMember]
public double UnityCheck { get; set; }
Property Value
double
 Edit this page